In [4]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

# 타이타닉 train 데이터 불러오기
df = pd.read_csv('train.csv', index_col='PassengerId')

df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df = df[['Pclass', 'Sex', 'SibSp', 'Parch','Fare','Survived']]
df['Sex'] = df['Sex'].map({'male':0, 'female':1})
df = df.dropna()
X = df.drop('Survived', axis=1)
y = df['Survived']

In [6]:
# feature, target 분리 (훈련, 테스트셋도 분리)
X_train, X_test, y_train, y_test = train_test_split(X,y, random_state=1)

In [9]:
# 의사결정나무 모델 형성 및 y 분류 시행
model = tree.DecisionTreeClassifier()
model.fit(X_train, y_train)
y_predict = model.predict(X_test)

In [10]:
accuracy_score(y_test, y_predict)

0.7982062780269058

In [11]:
from sklearn.metrics import confusion_matrix
pd.DataFrame(
    confusion_matrix(y_test, y_predict),
    columns = ['Predicted Not Survival', 'Predicted Survival'],
    index = ['True Not Survival', 'True Survival']
)

                   Predicted Not Survival  Predicted Survival
True Not Survival                     116                  12
True Survival                          33                  62